Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Constructor
Overload List
Name | Description
ReferenceModel()
 Initializes a new instance of the ReferenceModel class.
 The default values are as follows:
 Filename = string.Empty;
 ActiveFilePath = string.Empty;
 ProjectGUID = Guid.Empty;
 ModelGUID = Guid.Empty;
 VersionGUID = Guid.Empty;
 Position = new Point();
 Scale = 1.0;
 Visibility = VisibilityEnum.VISIBLE;
 BasePointGuid = string.Empty;
ReferenceModel(String, Point, Double)
 Initializes a new instance of the ReferenceModel class. Creates a new reference model instance using the given filename, position and scale.
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace